Documents/Поселение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Поселение</Name>
			<BasedOn>
				<xr:Item>Document.Бронирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрожитыеДниПостояльца</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Постоялец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеПостояльцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГостиницы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГостиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУвеличения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКУплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поселение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поселение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Поселение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Функция ПоляРасчетаОплатыЗаполнены()
	Возврат 
		ЗначениеЗаполнено(Объект.НачалоПериода)
		И ЗначениеЗаполнено(Объект.КонецПериода)
		И ЗначениеЗаполнено(Объект.НомерГостиницы);
КонецФункции


&НаКлиенте
Процедура ПостоялецПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;  
КонецПроцедуры


&НаКлиенте
Процедура НомерГостиницыПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;                        
КонецПроцедуры     


&НаКлиенте
Процедура ПроцентУвеличенияПриИзменении(Элемент) 
	РасчетОплатыНаСервере();
КонецПроцедуры 


&НаСервере
Процедура ОбнулитьПоляОплаты()        
	Объект.СуммаОплаты = 0;
	Объект.СуммаСкидки = 0;     
	Объект.ПроцентСкидки = 0;
    Объект.СуммаКУплате = 0;
КонецПроцедуры


&НаСервере
Процедура РасчетОплатыНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РасчетЗначений();     
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры
